package com.example.mtc.model;

import java.io.Serializable;

@SuppressWarnings("ALL")
public class HealthSuggest implements Serializable {
  public static final String[] suggest = {
          "得了糖尿病，血糖控制很重要，除了注意饮食之外，目前北京国医堂中医研究院糖尿病科的沈春宇专家介绍，血糖的控制很重要的方面在于运动，因为糖尿病的特殊性，科学运动显得尤为重要，以2型糖尿病为例，给出9点建议。\n" +
                  "　　1、2型糖尿病患者运动强度宜适中，一般来说以身体微微出汗为度。\n" +
                  "　　2、2型糖尿病患者运动宜每天坚持。每日坚持适量的运动，常可带来意想不到的效果。运动需要消耗能量，既可减轻体重，又可加强糖的利用，从而减少血中葡萄糖的蓄积，达到降糖的目的。\n" +
                  "　　3、2型糖尿病患者运动宜餐后进行。运动宜在餐后半小时至一小时后进行。因为餐前锻炼身体有可能引起血糖波动，既会因延迟进餐造成血糖过低，又可因没有服药使血糖过高。而餐后血糖相对平稳，适合运动健身。\n" +
                  "　　4、2型糖尿病患者运动宜在户外进行。并不是任何运动都能达到增进健康的目的，只有“有氧运动”才是保持身心健康的最有效的运动方式。如氧气不足会增加心肺负担，对健康不利。\n" +
                  "　　5、2型糖尿病患者血糖控制欠佳时忌运动。\n" +
                  "　　6、2型糖尿病患者当出现较重的糖尿病并发症时忌运动。此时要严格选择适宜的运动方式，因为稍有不当可能会造成血压升高以及脑血管意外、心肌梗死及下肢坏死等情况的发生。\n" +
                  "　　7、2型糖尿病患者有严重的糖尿病眼底病变时忌运动。患者视网膜微血管异常，运动不当可加重眼底病变。\n" +
                  "　　8、2型糖尿病患者有严重的糖尿病肾病时忌运动。运动过量会加大肾脏的血流量，增加尿蛋白的排出量，使糖尿病肾病加重",
          "患有糖尿病，在平时如何让血糖更稳定呢？\n" +
                  "1、主食选择：多食用纤维素较高的粗粮，麦胚，豆类等。粗细搭配，少食多餐，进食主食的总量应该控制在150g-250g左右。两餐间隔的时间最好是4-6小时，如果有加餐，那么热量应该从下一餐扣除，以免增加总体的摄入热量。\n" +
                  "2、均衡营养：在保证总热量平衡的前提下，食用含有蛋白质，例如瘦肉、鱼虾、蛋奶跟新鲜蔬菜等食物。烹制手法尽量少油少盐，此外糖尿病患者吃水果要限量，并且在两餐之间食用，如果血糖偏高时不建议食用水果可另选西红柿或黄瓜等代替。\n" +
                  "3、减肥：如果你是一个超重的糖尿病患者，哪最好就是通过适当的运动跟饮食控制来减轻提供。不仅可以改善血压、血脂，也有利于降低血糖。\n" +
                  "4、戒烟酒：这两者都不利于糖尿病的病情控制，烟草中含有的成分会让血管收缩，继而导致组织性缺血缺氧。对于伤口的愈合并没有好处，还会增加糖尿病足的发生率。\n" +
                  "5、适当运动：患有糖尿病的人群可以选择有氧运动，例如慢跑、自行车骑行，散步，太极拳等。可以帮助促进心肺功能，改善血糖值。不过需要注意的是，不能空腹运动，在饭后1小时运动较好。此外要根据自身的身体情况量力而行，循序渐进，不能一下子高强度的运动。不仅没有起到效果，反而出现其它意外，运动中出现任何不适都应该立即停止，休息查看原因。\n" +
                  "6、每天监测血糖：可以让我们清楚的知道自己的血糖范围，了解当天食物、药物或者运动对于血糖产生的影响。及时发现异样的血糖变化，减少并发症风险，血糖波动较大时更应该增加监测的次数。\n" +
                  "糖尿病患者如果能严格的遵守医生的嘱咐，自身有意识的控制，把血糖稳定在合适的范围，那么健康的自然长寿不是不可能。前提是患者有这个意识且严于律己。\n" +
                  "最后需要提醒的是，糖尿病患者除了稳定血糖之外，在生活上要小心碰伤或擦伤。不小心出现伤口也要快速、正确的处理，因为糖尿病会引发感染风险。定期的去医院检查，咨询医生的建议，预防糖尿病会带来的并发症。",
          "什么是1型糖尿病？1型糖尿病是指一种自身免疫性的糖尿病，由于体内自身免疫性的破坏，使得β细胞功能的缺失，而导致体内胰岛素的绝对缺乏，从而出现糖尿病。其次，遗传因素如人体第6个染色体上面HLA抗原的异常，以及受到病毒感染如柯萨奇病毒的感染等，都可能会导致人体出现1型糖尿病。糖尿病患者需要注意什么？日常中，对于糖尿病患者来说，控制血糖并不是一件容易的事，体内血糖容易受到各种因素的影响而出现波动。那么，生活中糖尿病患者需要注意哪些因素，避免受到刺激后血糖出现波动呢？对此提出了3个建议，帮助糖友更有效地控制血糖。\n" +
                  "1、健康的饮食习惯对糖尿病患者的饮食来说，应该以膳食平衡为主。在一个总量控制的前提下，建议患者肉类、蛋白类、青菜类、蔬果类都应该适当要进食，但是尽量要选用一些升糖指数比较低的食物。比如主食建议食用一些荞麦、燕麦或者玉米等粗粮，肉类建议食用鱼肉、瘦肉可能会更佳，对于蛋白的摄入建议牛奶、鸡蛋。同时，像草莓、桃子、芹菜等升糖指数是相对较低的蔬菜水果，也适合糖尿病患者食用。\n" +
                  "2、避免抽烟喝酒糖尿病患者需要及时戒烟戒酒，养成良好的生活习惯。糖尿病患者若吸烟，烟草在燃烧时会产生毒素，这些毒素会在分泌胰岛素的胰腺中积累。久而久之，可能会导致人体部分组织对胰岛素降糖效果产生抵抗，加重糖尿病，甚至引发其他并发症。其次，糖尿病患者喝酒会抑制食欲，导致患者营养不良。其次，长期饮酒的习惯可能会对肝脏功能和循环系统有一定的影响，甚至会抑制糖异生的作用，导致部分糖尿患者出现低血糖、酮症酸中毒的情况出现。\n",

                  "糖尿病患者很容易出现全身性疾病，手足、眼部、肾脏、心血管以及神经系统都很容易受到其影响，还会出现身体失水，电解质紊乱、酸碱失衡等症状。患者在治疗时如果没有采取正确的措施，很容易导致低血糖症。那么，糖尿病患者有哪些饮食禁忌以辅助治疗呢?\n" +
                  "一、低钠盐高纤维饮食：摄入的食盐过多，容易造成血压升高，增加人体心脏负担，出现高血压、动脉硬化等，还会引起多种糖尿病并发症。因此，糖尿病人要控制好每日的盐含量，多吃富含纤维素的食物，有利于促进脂肪以及胆固醇和糖物质的代谢，还有利于消化，减少便秘危害，减轻体重。\n" +
                  "二、少吃酸性、高脂肪、高蛋白、高糖的食物：糖尿病患者的体液为酸性，因此要尽量少吃酸性食物。包括谷类物质、鱼肉、禽肉等，都属于酸性食物;可以多吃新鲜绿色蔬菜，平衡酸碱度。高脂肪高蛋白容易引起动脉粥样硬化、高血脂以及多种心脑血管疾病，因此，要控制日常的脂肪、蛋白质、糖分的摄入。糖类物质引起代谢失衡，因此更要禁食。\n" +
                  "三、患者要禁食辛辣刺激的食物：辛辣刺激的食物容易引起上火、燥热等，加重病情。因此，辣椒、生姜、大蒜、芥末、胡椒等要禁食;也要禁食烟酒、可可、咖啡等。在吃降糖药的时候，要禁酒，酒精会导致血糖降低，不利于治疗;还会影响降糖药的药效发挥，因此，要禁酒。吸烟会导致血糖身高，影响降糖药物的药效，严重时会引发冠心病、心肌梗死、肢体溃疡、中风等并发症。\n" +
                  "患者要非常重视日常的饮食，患者药长期使用各种降糖药，因此，在饮食中，可以增加摄入一些护肾的食物，避免药物对肾脏的损害;要饮食清淡，盐糖等要适量摄入，饮食搭配要合理，荤素搭配，均衡营养;还要积极锻炼身体，增强身体素质;保持积极乐观的心态面对疾病。\n",
          "1、饮食 通过对饮食结构的调整达到辅助加强治疗效果，减轻糖尿病患者对药物的依赖性。不要吃含糖较高、高胆固醇以及含酒精等食物，少吃辛辣刺激性食物，可多吃五谷杂粮、豆类及豆制品。此外，苦瓜、桑叶、洋葱、香菇、柚子等可辅助降低血糖，是糖尿病人的理想食物。 2、运动 适当的运动可增强体质，提高胰岛素的敏感性，改善血脂代谢，调节体重，防止并发症的产生。运动后应有适意感且适当进食，避免出现低血糖。依照患者身体情况选择运动种类，如步行、慢跑、骑自行车、打太极拳、踢毽子、球类运动等有氧运动。坚持循序渐进，持之以恒的原则，运动应选择在餐后1h进行。 3、用药 糖尿病系终身性疾病，无论患者采用哪种降糖药物都会有相对不同的副作用和不良反应。患者应正确掌握用药的时间、用法及用量，如降糖药饭前、饭后服用的例外类型，用药要准确，凡在联合用药时更要小心谨慎，不要过量或重复使用。胰岛素在饭前半小时注射，注射后按时就餐。根据血糖情况，由医生来调整药物的剂量，避免患者乱用偏方或者盲目增减用药剂量。 4、预防并发症 让患者及家属严格执行糖尿病患者的饮食及运动方案，了解糖尿病并发症的相关知识。定期去医院进行血糖、尿糖监测，全面了解用药水平和控制水平。也可采用便携式血糖仪进行血糖的自我检测，经常测血压、血脂，积极控制高血压和治疗高血脂，定期检查眼底、眼压、防止视网膜病变等视力危机损害。鞋袜要合脚，卫生、透气，防止周围神经和血管病变致足损伤。症状严重者，要及时送往医院治疗，以免耽误病情。 5、心理 由于糖尿病是慢性、终身性疾病，患者又缺乏医学知识，加之环境因素的影响，可能会产生孤独、焦虑、抑郁、悲观失望、恐惧心理、甚至产生厌世心理。患病早期阶段应进行及时的心理疏导，帮助患者接受患病事实，尽快转变角色，接受治疗，有助于早期控制疾病的发展，同时鼓励家属共同参与，使他们增强战胜疾病的信心。"
  };
  private Long suggestId;

  private String healthDataType;

  private String healthDataRange;

  private String suggestContent;

  private static final long serialVersionUID = 1L;

  public Long getSuggestId() {
    return suggestId;
  }

  public void setSuggestId(Long suggestId) {
    this.suggestId = suggestId;
  }

  public String getHealthDataType() {
    return healthDataType;
  }

  public void setHealthDataType(String healthDataType) {
    this.healthDataType = healthDataType;
  }

  public String getHealthDataRange() {
    return healthDataRange;
  }

  public void setHealthDataRange(String healthDataRange) {
    this.healthDataRange = healthDataRange;
  }

  public String getSuggestContent() {
    return suggestContent;
  }

  public void setSuggestContent(String suggestContent) {
    this.suggestContent = suggestContent;
  }

  @Override
  public String toString() {
    return getClass().getSimpleName() +
            " [" +
            "Hash = " + hashCode() +
            ", suggestId=" + suggestId +
            ", healthDataType=" + healthDataType +
            ", healthDataRange=" + healthDataRange +
            ", suggestContent=" + suggestContent +
            ", serialVersionUID=" + serialVersionUID +
            "]";
  }
}